# EnableHookLengthOverride Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Rebar..::..EnableHookLengthOverride Method
Rebar Class See Also
---
Enables or disables the ability to override hook lengths for this rebar instance.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public void EnableHookLengthOverride(
	bool enable
)
```

Visual Basic
---
```text
Public Sub EnableHookLengthOverride ( _
	enable As Boolean _
)
```

Visual C++
---
```text
public:
void EnableHookLengthOverride(
	bool enable
)
```

# ### Parameters
enable
    Type: System..::..Boolean True to enable, False to disable.
# See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace